ПУМП/src/Catalogs/V012/V012.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V012</name>
  <comment>Исходы заболевания</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_USLOV</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V006/V006.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V006</name>
  <comment>Классификатор Условий Оказания Медицинской Помощи (V006)</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V012/Forms/ФормаЭлемента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьИмяУсловий(идУсловия)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	V006.NAME,
	|	V006.DATE_BEG,
	|	V006.DATE_END
	|ИЗ
	|	Справочник.V006 КАК V006
	|ГДЕ
	|	V006.ID = &ID";
	Запрос.УстановитьПараметр("ID",идУсловия);
	пРез=Запрос.Выполнить().Выгрузить();
	Возврат пРез;
КонецФункции	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем пНаименование;
	пНаименование="";
	пТЗ=ПолучитьИмяУсловий(Объект.ID_USLOV);
	Если пТЗ.Количество()>0 Тогда
		пСтрока=пТЗ.Получить(0);
		пНаименование=пСтрока["NAME"];
	КонецЕсли;		
	ЭтотОбъект.NAME_USLOV=пНаименование;
КонецПроцедуры
